app/views/users/index.html.erb

     <li class="article-title"><%= link_to user.username, user_path(user) %></li>
     <li><small><%= pluralize(user.articles.count, "article") if user.articles %></small></li>
---
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 2]]