app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description") VALUES (?, ?)  [["title", "tunna"], ["description", "tunna is smart"]]
---
def create
   @article = Article.new(article_params)
   @article.user = User.first
  if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ? WHERE "articles"."id" = ?  [["title", "Hello Fellas !!!!!"], ["description", "Woah!!!! My first description....."], ["id", 1]]
---
 def update
 	 @article = Article.find(params[:id])
  if @article.update(article_params)