app/controllers/users_controller.rb

	def index
		@articles = Article.paginate(page: params[:page], per_page: 5)
---
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 2]]